import math
print ("Задание 59(а)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
if (((x*x)+(y*y))<=1): print("Точка пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")

print ("Задание 59(б)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
L = (pow((0-x)*(0-x),2))+(pow((0-y)*(0-y),2))
if ((L<=1) and (L>=0.5) or (L<=-1) and (L>=-0.5)):
    print("Точка пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")

print ("Задание 59(в)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
if (x>=0) and ((x*x+y*y)<=1) or((x<0) and (abs(y)<=(0.5*x+1))):
   print("Точка не пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")

print ("Задание 59(д)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
t = abs(x)
if ((2.0*x-1.0<=y) and (-2*x-1.0<=y) and (2.0*x+1.0 >= y) and (-2.0*x+1.0>=0)) :print("Точка пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")
                                                                
print ("Задание 59(ж)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
if ((abs(x)<1) and (y>=-1) and (y<=x/3+2) and (y<=-x/3+2)):
    print("Точка пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")

print ("Задание 59(к)")
x = input("Введите x: ")
y = input("Введите y: ")
x = float(x)
y = float(y)
t = abs(x)
if (t<1):
    if (y>=t):print("Точка пренадлежит заштрихованой оласти")
    else: print("Точка не пренадлежит заштрихованой оласти")
elif (y>=1):print("Точка пренадлежит заштрихованой оласти")
else: print("Точка не пренадлежит заштрихованой оласти")

